<a href="https://colab.research.google.com/github/webabdullah/COLLECTED_LEARN/blob/main/data_set_titanic(part4).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [7]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import scipy.stats as scp

In [8]:
titanic = pd.read_csv("titanic_all.csv")
print("data :",titanic.shape)

data : (1309, 12)

In [9]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  1309 non-null   int64
 1   Survived     1309 non-null   int64
 2   Pclass       1309 non-null   int64
 3   Name         1309 non-null   object
 4   Sex          1309 non-null   object
 5   Age          1046 non-null   float64
 6   SibSp        1309 non-null   int64
 7   Parch        1309 non-null   int64
 8   Ticket       1309 non-null   object
 9   Fare         1308 non-null   float64
 10  Cabin        295 non-null    object
 11  Embarked     1307 non-null   object
dtypes: float64(2), int64(5), object(5)
memory usage: 122.8+ KB

In [10]:
titanic.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [11]:
titanic.describe()

       PassengerId     Survived  ...        Parch         Fare
count  1309.000000  1309.000000  ...  1309.000000  1308.000000
mean    655.000000     0.377387  ...     0.385027    33.295479
std     378.020061     0.484918  ...     0.865560    51.758668
min       1.000000     0.000000  ...     0.000000     0.000000
25%     328.000000     0.000000  ...     0.000000     7.895800
50%     655.000000     0.000000  ...     0.000000    14.454200
75%     982.000000     1.000000  ...     0.000000    31.275000
max    1309.000000     1.000000  ...     9.000000   512.329200

[8 rows x 7 columns]